---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.End1
enum: Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType
source: html/71dafbc2-6ff2-5931-9d31-66f206a65476.htm
---
# Autodesk.Revit.DB.Structure.RebarConstraintTargetHostFaceType.End1

Face forms the end surface of the host geometry.